---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.UsGallons
source: html/4c1c4bb0-4bdf-56cd-2ecc-efea24ef320d.htm
---
# Autodesk.Revit.DB.UnitTypeId.UsGallons Property

US gallons.

## Syntax (C#)
```csharp
public static ForgeTypeId UsGallons { get; }
```